//
//  Container.h
//  FCDylib
//
//  Created by mcloud－sec on 15/3/26.
//  Copyright (c) 2015年 huawei. All rights reserved.
//

#ifndef FILECONTAINER_Container_h
#define FILECONTAINER_Container_h

#import <Foundation/Foundation.h>

@interface  Container : NSObject
/**************************************************************/
// 初始化函数
// 参数:
//			userpath-[IN]包所在路径
// 返回值:
/**************************************************************/
- (instancetype)initWithUserPath:(NSString *)userpath;  //初始化
/**************************************************************/
// 字符串加密函数
// 参数:
//			plain-[IN]待加密字符串
// 返回值: 成功：加密后的字符串密文 失败：nil
/**************************************************************/
- (NSString*)stringEncrypt:(NSString *)plain;//字符串加密
/**************************************************************/
// 字符串解密函数
// 参数:
//			crypto-[IN]待解密字符串
// 返回值: 成功：解密后的字符串 失败：nil
/**************************************************************/
- (NSString*)stringDecrypt:(NSString*)crypto;//字符串解密
/**************************************************************/
// 文件加密函数
// 参数:
//			filePath-[IN]待加密文件所在绝对路径
//			userUID-[IN]用户UID
//			fileName-[IN]待加密文件名称
// 返回值: 成功：YES 失败 NO
/**************************************************************/
- (BOOL)fileEncrypt:(NSString*)filePath ofUserUID: (NSString*)userUID ofFileName: (NSString*)fileName;//文件加密
/**************************************************************/
// 文件解密函数
// 参数:
//			userUID-[IN]用户UID
//			fileName-[IN]待解密文件名称
// 返回值: 成功：解密后明文所在绝对路径 失败：nil
/**************************************************************/
- (NSString*)fileDecrypt:(NSString*)userUID ofFileName:(NSString*)fileName;//文件解密
/**************************************************************/
// 根据UID删除文件函数
// 参数:
//			userUID-[IN]用户UID
// 返回值: 成功：YES 失败 NO
/**************************************************************/
- (BOOL)delFileByUID:(NSString*)userUID;//删除UID目录下所有文件
/**************************************************************/
// 删除所有加密文件函数
// 参数:
// 返回值: 成功：YES 失败 NO
/**************************************************************/
- (BOOL)delAllFile;//删除所有文件
/**************************************************************/
// 根据指定路径删除文件函数
// 参数:
//			filePath-[IN]待删除文件绝对路径
// 返回值: 成功：YES 失败 NO
/**************************************************************/
- (BOOL)delFileByPath:(NSString*)filePath;//删除指定文件

@end

#endif

